AndreQingyuWu/bmi160-driver-for-NRF5/bmi160_defs.h
/**
 * Copyright (c) 2020 Bosch Sensortec GmbH. All rights reserved.
 *
 * BSD-3-Clause
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived from
 *    this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
 * IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * @file bmi160_defs.h
 * @date 10/01/2020
 * @version  3.8.1
 *
 */

/*!
 * @defgroup bmi160_defs
 * @brief
 * @{*/

#ifndef BMI160_DEFS_H_
#define BMI160_DEFS_H_

/*************************** C types headers *****************************/
#ifdef __KERNEL__
#include <linux/kernel.h>
#include <linux/types.h>

#else
#include <stddef.h>
#include <stdint.h>

#endif

/*************************** Common macros   *****************************/

#if !defined(UINT8_C) && !defined(INT8_C)
#define INT8_C(x) S8_C(x)
#define UINT8_C(x) U8_C(x)
#endif

#if !defined(UINT16_C) && !defined(INT16_C)
#define INT16_C(x) S16_C(x)
#define UINT16_C(x) U16_C(x)
#endif

#if !defined(INT32_C) && !defined(UINT32_C)
#define INT32_C(x) S32_C(x)
#define UINT32_C(x) U32_C(x)
#endif

#if !defined(INT64_C) && !defined(UINT64_C)
#define INT64_C(x) S64_C(x)
#define UINT64_C(x) U64_C(x)
#endif

/**@}*/
/**\name C standard macros */
#ifndef NULL
#ifdef __cplusplus
#define NULL 0
#else
#define NULL ((void *)0)
#endif
#endif

/*************************** Sensor macros   *****************************/
/* Test for an endian machine */
#ifndef __ORDER_LITTLE_ENDIAN__
#define __ORDER_LITTLE_ENDIAN__ 0
#endif

#ifndef __BYTE_ORDER__
#define __BYTE_ORDER__ __ORDER_LITTLE_ENDIAN__
#endif

#if __BYTE_ORDER__ == __ORDER_LITTLE_ENDIAN__
#ifndef LITTLE_ENDIAN
#define LITTLE_ENDIAN 1
#endif
#elif __BYTE_ORDER__ == __ORDER_BIG_ENDIAN__
#ifndef BIG_ENDIAN
#define BIG_ENDIAN 1
#endif
#else
#error "Code does not support Endian format of the processor"
#endif

/** GPIO definitions */
#define BMI160_CSB_PIN UINT8_C(9)
#define BMI160_INT1_PIN UINT8_C(5)
#define BMI160_SCL_PIN UINT8_C(14)
#define BMI160_SDA_PIN UINT8_C(30)

/** Mask definitions */
#define BMI160_ACCEL_BW_MASK UINT8_C(0x70)
#define BMI160_ACCEL_ODR_MASK UINT8_C(0x0F)
#define BMI160_ACCEL_UNDERSAMPLING_MASK UINT8_C(0x80)
#define BMI160_ACCEL_RANGE_MASK UINT8_C(0x0F)
#define BMI160_GYRO_BW_MASK UINT8_C(0x30)
#define BMI160_GYRO_ODR_MASK UINT8_C(0x0F)
#define BMI160_GYRO_RANGE_MSK UINT8_C(0x07)

/** Mask definitions for INT_EN registers */
#define BMI160_ANY_MOTION_X_INT_EN_MASK UINT8_C(0x01)
#define BMI160_HIGH_G_X_INT_EN_MASK UINT8_C(0x01)
#define BMI160_NO_MOTION_X_INT_EN_MASK UINT8_C(0x01)
#define BMI160_ANY_MOTION_Y_INT_EN_MASK UINT8_C(0x02)
#define BMI160_HIGH_G_Y_INT_EN_MASK UINT8_C(0x02)
#define BMI160_NO_MOTION_Y_INT_EN_MASK UINT8_C(0x02)
#define BMI160_ANY_MOTION_Z_INT_EN_MASK UINT8_C(0x04)
#define BMI160_HIGH_G_Z_INT_EN_MASK UINT8_C(0x04)
#define BMI160_NO_MOTION_Z_INT_EN_MASK UINT8_C(0x04)
#define BMI160_SIG_MOTION_INT_EN_MASK UINT8_C(0x07)
#define BMI160_ANY_MOTION_ALL_INT_EN_MASK UINT8_C(0x07)
#define BMI160_STEP_DETECT_INT_EN_MASK UINT8_C(0x08)
#define BMI160_DOUBLE_TAP_INT_EN_MASK UINT8_C(0x10)
#define BMI160_SINGLE_TAP_INT_EN_MASK UINT8_C(0x20)
#define BMI160_FIFO_FULL_INT_EN_MASK UINT8_C(0x20)
#define BMI160_ORIENT_INT_EN_MASK UINT8_C(0x40)
#define BMI160_FIFO_WATERMARK_INT_EN_MASK UINT8_C(0x40)
#define BMI160_LOW_G_INT_EN_MASK UINT8_C(0x08)
#define BMI160_STEP_DETECT_EN_MASK UINT8_C(0x08)
#define BMI160_FLAT_INT_EN_MASK UINT8_C(0x80)
#define BMI160_DATA_RDY_INT_EN_MASK UINT8_C(0x10)

/** PMU status Macros */
#define BMI160_AUX_PMU_SUSPEND UINT8_C(0x00)
#define BMI160_AUX_PMU_NORMAL UINT8_C(0x01)
#define BMI160_AUX_PMU_LOW_POWER UINT8_C(0x02)

#define BMI160_GYRO_PMU_SUSPEND UINT8_C(0x00)
#define BMI160_GYRO_PMU_NORMAL UINT8_C(0x01)
#define BMI160_GYRO_PMU_FSU UINT8_C(0x03)

#define BMI160_ACCEL_PMU_SUSPEND UINT8_C(0x00)
#define BMI160_ACCEL_PMU_NORMAL UINT8_C(0x01)
#define BMI160_ACCEL_PMU_LOW_POWER UINT8_C(0x02)

/** Mask definitions for INT_OUT_CTRL register */
#define BMI160_INT1_EDGE_CTRL_MASK UINT8_C(0x01)
#define BMI160_INT1_OUTPUT_MODE_MASK UINT8_C(0x04)
#define BMI160_INT1_OUTPUT_TYPE_MASK UINT8_C(0x02)
#define BMI160_INT1_OUTPUT_EN_MASK UINT8_C(0x08)
#define BMI160_INT2_EDGE_CTRL_MASK UINT8_C(0x10)
#define BMI160_INT2_OUTPUT_MODE_MASK UINT8_C(0x40)
#define BMI160_INT2_OUTPUT_TYPE_MASK UINT8_C(0x20)
#define BMI160_INT2_OUTPUT_EN_MASK UINT8_C(0x80)

/** Mask definitions for INT_LATCH register */
#define BMI160_INT1_INPUT_EN_MASK UINT8_C(0x10)
#define BMI160_INT2_INPUT_EN_MASK UINT8_C(0x20)
#define BMI160_INT_LATCH_MASK UINT8_C(0x0F)

/** Mask definitions for INT_MAP register */
#define BMI160_INT1_LOW_G_MASK UINT8_C(0x01)
#define BMI160_INT1_HIGH_G_MASK UINT8_C(0x02)
#define BMI160_INT1_SLOPE_MASK UINT8_C(0x04)
#define BMI160_INT1_NO_MOTION_MASK UINT8_C(0x08)
#define BMI160_INT1_DOUBLE_TAP_MASK UINT8_C(0x10)
#define BMI160_INT1_SINGLE_TAP_MASK UINT8_C(0x20)
#define BMI160_INT1_FIFO_FULL_MASK UINT8_C(0x20)
#define BMI160_INT1_FIFO_WM_MASK UINT8_C(0x40)
#define BMI160_INT1_ORIENT_MASK UINT8_C(0x40)
#define BMI160_INT1_FLAT_MASK UINT8_C(0x80)
#define BMI160_INT1_DATA_READY_MASK UINT8_C(0x80)
#define BMI160_INT2_LOW_G_MASK UINT8_C(0x01)
#define BMI160_INT1_LOW_STEP_DETECT_MASK UINT8_C(0x01)
#define BMI160_INT2_LOW_STEP_DETECT_MASK UINT8_C(0x01)
#define BMI160_INT2_HIGH_G_MASK UINT8_C(0x02)
#define BMI160_INT2_FIFO_FULL_MASK UINT8_C(0x02)
#define BMI160_INT2_FIFO_WM_MASK UINT8_C(0x04)
#define BMI160_INT2_SLOPE_MASK UINT8_C(0x04)
#define BMI160_INT2_DATA_READY_MASK UINT8_C(0x08)
#define BMI160_INT2_NO_MOTION_MASK UINT8_C(0x08)
#define BMI160_INT2_DOUBLE_TAP_MASK UINT8_C(0x10)
#define BMI160_INT2_SINGLE_TAP_MASK UINT8_C(0x20)
#define BMI160_INT2_ORIENT_MASK UINT8_C(0x40)
#define BMI160_INT2_FLAT_MASK UINT8_C(0x80)

/** Mask definitions for INT_DATA register */
#define BMI160_TAP_SRC_INT_MASK UINT8_C(0x08)
#define BMI160_LOW_HIGH_SRC_INT_MASK UINT8_C(0x80)
#define BMI160_MOTION_SRC_INT_MASK UINT8_C(0x80)

