AndreQingyuWu/bmi160-driver-for-NRF5/bmi160_defs.h
  /*! output data rate */
  uint8_t odr;

  /*! range */
  uint8_t range;

  /*! bandwidth */
  uint8_t bw;
};

/*!
 * @brief Aux sensor configuration structure
 */
struct bmi160_aux_cfg {
  /*! Aux sensor, 1 - enable 0 - disable */
  uint8_t aux_sensor_enable : 1;

  /*! Aux manual/auto mode status */
  uint8_t manual_enable : 1;

  /*! Aux read burst length */
  uint8_t aux_rd_burst_len : 2;

  /*! output data rate */
  uint8_t aux_odr : 4;

  /*! i2c addr of auxiliary sensor */
  uint8_t aux_i2c_addr;
};

/*!
 * @brief bmi160 interrupt channel selection structure
 */
enum bmi160_int_channel {
  /*! Un-map both channels */
  BMI160_INT_CHANNEL_NONE,

  /*! interrupt Channel 1 */
  BMI160_INT_CHANNEL_1,

  /*! interrupt Channel 2 */
  BMI160_INT_CHANNEL_2,

  /*! Map both channels */
  BMI160_INT_CHANNEL_BOTH
};
enum bmi160_int_types {
  /*! Slope/Any-motion interrupt */
  BMI160_ACC_ANY_MOTION_INT,

  /*! Significant motion interrupt */
  BMI160_ACC_SIG_MOTION_INT,

  /*! Step detector interrupt */
  BMI160_STEP_DETECT_INT,

  /*! double tap interrupt */
  BMI160_ACC_DOUBLE_TAP_INT,

  /*! single tap interrupt */
  BMI160_ACC_SINGLE_TAP_INT,

  /*! orientation interrupt */
  BMI160_ACC_ORIENT_INT,

  /*! flat interrupt */
  BMI160_ACC_FLAT_INT,

  /*! high-g interrupt */
  BMI160_ACC_HIGH_G_INT,

  /*! low-g interrupt */
  BMI160_ACC_LOW_G_INT,

  /*! slow/no-motion interrupt */
  BMI160_ACC_SLOW_NO_MOTION_INT,

  /*! data ready interrupt  */
  BMI160_ACC_GYRO_DATA_RDY_INT,

  /*! fifo full interrupt */
  BMI160_ACC_GYRO_FIFO_FULL_INT,

  /*! fifo watermark interrupt */
  BMI160_ACC_GYRO_FIFO_WATERMARK_INT,

  /*! fifo tagging feature support */
  BMI160_FIFO_TAG_INT_PIN
};

/*!
 * @brief bmi160 active state of any & sig motion interrupt.
 */
enum bmi160_any_sig_motion_active_interrupt_state {
  /*! Both any & sig motion are disabled */
  BMI160_BOTH_ANY_SIG_MOTION_DISABLED = -1,

  /*! Any-motion selected */
  BMI160_ANY_MOTION_ENABLED,

  /*! Sig-motion selected */
  BMI160_SIG_MOTION_ENABLED
};
struct bmi160_acc_tap_int_cfg {
#if LITTLE_ENDIAN == 1

  /*! tap threshold */
  uint16_t tap_thr : 5;

  /*! tap shock */
  uint16_t tap_shock : 1;

  /*! tap quiet */
  uint16_t tap_quiet : 1;

  /*! tap duration */
  uint16_t tap_dur : 3;

  /*! data source 0- filter & 1 pre-filter*/
  uint16_t tap_data_src : 1;

  /*! tap enable, 1 - enable, 0 - disable */
  uint16_t tap_en : 1;
#elif BIG_ENDIAN == 1

  /*! tap enable, 1 - enable, 0 - disable */
  uint16_t tap_en : 1;

  /*! data source 0- filter & 1 pre-filter*/
  uint16_t tap_data_src : 1;

  /*! tap duration */
  uint16_t tap_dur : 3;

  /*! tap quiet */
  uint16_t tap_quiet : 1;

  /*! tap shock */
  uint16_t tap_shock : 1;

  /*! tap threshold */
  uint16_t tap_thr : 5;
#endif
};
struct bmi160_acc_any_mot_int_cfg {
#if LITTLE_ENDIAN == 1

  /*! 1 any-motion enable, 0 - any-motion disable */
  uint8_t anymotion_en : 1;

  /*! slope interrupt x, 1 - enable, 0 - disable */
  uint8_t anymotion_x : 1;

  /*! slope interrupt y, 1 - enable, 0 - disable */
  uint8_t anymotion_y : 1;

  /*! slope interrupt z, 1 - enable, 0 - disable */
  uint8_t anymotion_z : 1;

  /*! slope duration */
  uint8_t anymotion_dur : 2;

  /*! data source 0- filter & 1 pre-filter*/
  uint8_t anymotion_data_src : 1;

  /*! slope threshold */
  uint8_t anymotion_thr;
#elif BIG_ENDIAN == 1

  /*! slope threshold */
  uint8_t anymotion_thr;

  /*! data source 0- filter & 1 pre-filter*/
  uint8_t anymotion_data_src : 1;

  /*! slope duration */
  uint8_t anymotion_dur : 2;

  /*! slope interrupt z, 1 - enable, 0 - disable */
  uint8_t anymotion_z : 1;

  /*! slope interrupt y, 1 - enable, 0 - disable */
  uint8_t anymotion_y : 1;

  /*! slope interrupt x, 1 - enable, 0 - disable */
  uint8_t anymotion_x : 1;

  /*! 1 any-motion enable, 0 - any-motion disable */
  uint8_t anymotion_en : 1;
#endif
};
struct bmi160_acc_sig_mot_int_cfg {
#if LITTLE_ENDIAN == 1

  /*! skip time of sig-motion interrupt */
  uint8_t sig_mot_skip : 2;

  /*! proof time of sig-motion interrupt */
  uint8_t sig_mot_proof : 2;

  /*! data source 0- filter & 1 pre-filter*/
  uint8_t sig_data_src : 1;

  /*! 1 - enable sig, 0 - disable sig & enable anymotion */
  uint8_t sig_en : 1;

  /*! sig-motion threshold */
  uint8_t sig_mot_thres;
#elif BIG_ENDIAN == 1

  /*! sig-motion threshold */
  uint8_t sig_mot_thres;

  /*! 1 - enable sig, 0 - disable sig & enable anymotion */
  uint8_t sig_en : 1;

  /*! data source 0- filter & 1 pre-filter*/
  uint8_t sig_data_src : 1;

  /*! proof time of sig-motion interrupt */
  uint8_t sig_mot_proof : 2;

  /*! skip time of sig-motion interrupt */
  uint8_t sig_mot_skip : 2;
#endif
};
struct bmi160_acc_step_detect_int_cfg {
#if LITTLE_ENDIAN == 1

  /*! 1- step detector enable, 0- step detector disable */
  uint16_t step_detector_en : 1;

  /*! minimum threshold */
  uint16_t min_threshold : 2;

  /*! minimal detectable step time */
  uint16_t steptime_min : 3;

  /*! enable step counter mode setting */
  uint16_t step_detector_mode : 2;

  /*! minimum step buffer size*/
  uint16_t step_min_buf : 3;
#elif BIG_ENDIAN == 1

  /*! minimum step buffer size*/
  uint16_t step_min_buf : 3;

  /*! enable step counter mode setting */
  uint16_t step_detector_mode : 2;

  /*! minimal detectable step time */
  uint16_t steptime_min : 3;

  /*! minimum threshold */
  uint16_t min_threshold : 2;

  /*! 1- step detector enable, 0- step detector disable */
  uint16_t step_detector_en : 1;
#endif
};
struct bmi160_acc_no_motion_int_cfg {
#if LITTLE_ENDIAN == 1

  /*! no motion interrupt x */
  uint16_t no_motion_x : 1;

  /*! no motion interrupt y */
  uint16_t no_motion_y : 1;

  /*! no motion interrupt z */
  uint16_t no_motion_z : 1;

  /*! no motion duration */
  uint16_t no_motion_dur : 6;

