AndreQingyuWu/bmi160-driver-for-NRF5/bmi160_defs.h
  /*! no motion sel , 1 - enable no-motion ,0- enable slow-motion */
  uint16_t no_motion_sel : 1;

  /*! data source 0- filter & 1 pre-filter*/
  uint16_t no_motion_src : 1;

  /*! no motion threshold */
  uint8_t no_motion_thres;
#elif BIG_ENDIAN == 1

  /*! no motion threshold */
  uint8_t no_motion_thres;

  /*! data source 0- filter & 1 pre-filter*/
  uint16_t no_motion_src : 1;

  /*! no motion sel , 1 - enable no-motion ,0- enable slow-motion */
  uint16_t no_motion_sel : 1;

  /*! no motion duration */
  uint16_t no_motion_dur : 6;

  /* no motion interrupt z */
  uint16_t no_motion_z : 1;

  /*! no motion interrupt y */
  uint16_t no_motion_y : 1;

  /*! no motion interrupt x */
  uint16_t no_motion_x : 1;
#endif
};
struct bmi160_acc_orient_int_cfg {
#if LITTLE_ENDIAN == 1

  /*! thresholds for switching between the different orientations */
  uint16_t orient_mode : 2;

  /*! blocking_mode */
  uint16_t orient_blocking : 2;

  /*! Orientation interrupt hysteresis */
  uint16_t orient_hyst : 4;

  /*! Orientation interrupt theta */
  uint16_t orient_theta : 6;

  /*! Enable/disable Orientation interrupt */
  uint16_t orient_ud_en : 1;

  /*! exchange x- and z-axis in algorithm ,0 - z, 1 - x */
  uint16_t axes_ex : 1;

  /*! 1 - orient enable, 0 - orient disable */
  uint8_t orient_en : 1;
#elif BIG_ENDIAN == 1

  /*! 1 - orient enable, 0 - orient disable */
  uint8_t orient_en : 1;

  /*! exchange x- and z-axis in algorithm ,0 - z, 1 - x */
  uint16_t axes_ex : 1;

  /*! Enable/disable Orientation interrupt */
  uint16_t orient_ud_en : 1;

  /*! Orientation interrupt theta */
  uint16_t orient_theta : 6;

  /*! Orientation interrupt hysteresis */
  uint16_t orient_hyst : 4;

  /*! blocking_mode */
  uint16_t orient_blocking : 2;

  /*! thresholds for switching between the different orientations */
  uint16_t orient_mode : 2;
#endif
};
struct bmi160_acc_flat_detect_int_cfg {
#if LITTLE_ENDIAN == 1

  /*! flat threshold */
  uint16_t flat_theta : 6;

  /*! flat interrupt hysteresis */
  uint16_t flat_hy : 3;

  /*! delay time for which the flat value must remain stable for the
   * flat interrupt to be generated */
  uint16_t flat_hold_time : 2;

  /*! 1 - flat enable, 0 - flat disable */
  uint16_t flat_en : 1;
#elif BIG_ENDIAN == 1

  /*! 1 - flat enable, 0 - flat disable */
  uint16_t flat_en : 1;

  /*! delay time for which the flat value must remain stable for the
   * flat interrupt to be generated */
  uint16_t flat_hold_time : 2;

  /*! flat interrupt hysteresis */
  uint16_t flat_hy : 3;

  /*! flat threshold */
  uint16_t flat_theta : 6;
#endif
};
struct bmi160_acc_low_g_int_cfg {
#if LITTLE_ENDIAN == 1

  /*! low-g interrupt trigger delay */
  uint8_t low_dur;

  /*! low-g interrupt trigger threshold */
  uint8_t low_thres;

  /*! hysteresis of low-g interrupt */
  uint8_t low_hyst : 2;

  /*! 0 - single-axis mode ,1 - axis-summing mode */
  uint8_t low_mode : 1;

  /*! data source 0- filter & 1 pre-filter */
  uint8_t low_data_src : 1;

  /*! 1 - enable low-g, 0 - disable low-g */
  uint8_t low_en : 1;
#elif BIG_ENDIAN == 1

  /*! 1 - enable low-g, 0 - disable low-g */
  uint8_t low_en : 1;

  /*! data source 0- filter & 1 pre-filter */
  uint8_t low_data_src : 1;

  /*! 0 - single-axis mode ,1 - axis-summing mode */
  uint8_t low_mode : 1;

  /*! hysteresis of low-g interrupt */
  uint8_t low_hyst : 2;

  /*! low-g interrupt trigger threshold */
  uint8_t low_thres;

  /*! low-g interrupt trigger delay */
  uint8_t low_dur;
#endif
};
struct bmi160_acc_high_g_int_cfg {
#if LITTLE_ENDIAN == 1

  /*! High-g interrupt x, 1 - enable, 0 - disable */
  uint8_t high_g_x : 1;

  /*! High-g interrupt y, 1 - enable, 0 - disable */
  uint8_t high_g_y : 1;

  /*! High-g interrupt z, 1 - enable, 0 - disable */
  uint8_t high_g_z : 1;

  /*! High-g hysteresis  */
  uint8_t high_hy : 2;

  /*! data source 0- filter & 1 pre-filter */
  uint8_t high_data_src : 1;

  /*! High-g threshold */
  uint8_t high_thres;

  /*! High-g duration */
  uint8_t high_dur;
#elif BIG_ENDIAN == 1

  /*! High-g duration */
  uint8_t high_dur;

  /*! High-g threshold */
  uint8_t high_thres;

  /*! data source 0- filter & 1 pre-filter */
  uint8_t high_data_src : 1;

  /*! High-g hysteresis  */
  uint8_t high_hy : 2;

  /*! High-g interrupt z, 1 - enable, 0 - disable */
  uint8_t high_g_z : 1;

  /*! High-g interrupt y, 1 - enable, 0 - disable */
  uint8_t high_g_y : 1;

  /*! High-g interrupt x, 1 - enable, 0 - disable */
  uint8_t high_g_x : 1;
#endif
};
struct bmi160_int_pin_settg {
#if LITTLE_ENDIAN == 1

  /*! To enable either INT1 or INT2 pin as output.
   * 0- output disabled ,1- output enabled */
  uint16_t output_en : 1;

  /*! 0 - push-pull 1- open drain,only valid if output_en is set 1 */
  uint16_t output_mode : 1;

  /*! 0 - active low , 1 - active high level.
   * if output_en is 1,this applies to interrupts,else PMU_trigger */
  uint16_t output_type : 1;

  /*! 0 - level trigger , 1 - edge trigger  */
  uint16_t edge_ctrl : 1;

  /*! To enable either INT1 or INT2 pin as input.
   * 0 - input disabled ,1 - input enabled */
  uint16_t input_en : 1;

  /*! latch duration*/
  uint16_t latch_dur : 4;
#elif BIG_ENDIAN == 1

  /*! latch duration*/
  uint16_t latch_dur : 4;

  /*! Latched,non-latched or temporary interrupt modes */
  uint16_t input_en : 1;

  /*! 1 - edge trigger, 0 - level trigger */
  uint16_t edge_ctrl : 1;

  /*! 0 - active low , 1 - active high level.
   * if output_en is 1,this applies to interrupts,else PMU_trigger */
  uint16_t output_type : 1;

  /*! 0 - push-pull , 1 - open drain,only valid if output_en is set 1 */
  uint16_t output_mode : 1;

  /*! To enable either INT1 or INT2 pin as output.
   * 0 - output disabled , 1 - output enabled */
  uint16_t output_en : 1;
#endif
};
union bmi160_int_type_cfg {
  /*! Tap interrupt structure */
  struct bmi160_acc_tap_int_cfg acc_tap_int;

  /*! Slope interrupt structure */
  struct bmi160_acc_any_mot_int_cfg acc_any_motion_int;

  /*! Significant motion interrupt structure */
  struct bmi160_acc_sig_mot_int_cfg acc_sig_motion_int;

  /*! Step detector interrupt structure */
  struct bmi160_acc_step_detect_int_cfg acc_step_detect_int;

